app/controllers/deals_controller.rb

SELECT "deals".* FROM "deals"
---
  def index
    @deals = Deal.all

INSERT INTO "deals" ("restaurant", "category", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @deal = Deal.new(deal_params)

    if @deal.save